content/api/shipping-guide_2/examples/soap_estimated_delivery_time_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.bring.no/logistics/shippingguide/2.0">
<soapenv:Header/>
<soapenv:Body>
  <ns:ShippingGuideRequest>
    <ns:Language>en</ns:Language>
    <ns:WithPrice>true</ns:WithPrice>
    <ns:WithExpectedDelivery>true</ns:WithExpectedDelivery>
    <ns:WithGuiInformation>true</ns:WithGuiInformation>
    <ns:NumberOfAlternativeDeliveryDates>0</ns:NumberOfAlternativeDeliveryDates>
    <ns:EDI>true</ns:EDI>
    <ns:Trace>true</ns:Trace>
    <ns:PostingAtPostoffice>true</ns:PostingAtPostoffice>
    <ns:WithEstimatedDeliveryTime>true</ns:WithEstimatedDeliveryTime>
    <ns:Consignments>
      <ns:Consignment id="101">
        <ns:Products>
          <ns:Product>
            <ns:Id>SERVICEPAKKE</ns:Id>
            <ns:CustomerNumber>PARCELS_NORWAY-00000000001</ns:CustomerNumber>
          </ns:Product>
        </ns:Products>
        <ns:FromCountryCode>NO</ns:FromCountryCode>
        <ns:FromPostalCode>0150</ns:FromPostalCode>
        <ns:ToCountryCode>NO</ns:ToCountryCode>
        <ns:ToPostalCode>0550</ns:ToPostalCode>
        <ns:ShippingDate>
          <ns:Year>2020</ns:Year>
          <ns:Month>09</ns:Month>
          <ns:Day>10</ns:Day>
          <ns:Hour>15</ns:Hour>
          <ns:Minute>00</ns:Minute>
        </ns:ShippingDate>
        <ns:Packages>
          <ns:Package id="10">
            <ns:Height>10</ns:Height>
            <ns:Width>10</ns:Width>
            <ns:Length>10</ns:Length>
            <ns:GrossWeight>50</ns:GrossWeight>
          </ns:Package>
        </ns:Packages>
        <ns:AdditionalServices>
          <ns:AdditionalService>
            <ns:Id>EVARSLING</ns:Id>
          </ns:AdditionalService>
        </ns:AdditionalServices>
        <ns:PickupPoints>
          <ns:PickupPoint>
            <ns:Id>124518</ns:Id>
          </ns:PickupPoint>
        </ns:PickupPoints>
      </ns:Consignment>
    </ns:Consignments>
  </ns:ShippingGuideRequest>
</soapenv:Body>
</soapenv:Envelope>
